package step_2;

import java.util.Scanner;

public class UserInput {

    public static void main(String[] args) {
        Scanner userInput = new Scanner(System.in);
        System.out.println(userInput.nextLine());
    }
}

/*
1. Напишите программу, которая запрашивает у пользователя имя и выводит Привет + Имя
 */